RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <condition id="allOf.component.serial_manager, utility.assert, utility.debug_console.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="RTE_Device.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.dmamux, driver.edma.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MK22FN512xxx12, driver.dmamux, driver.edma.internal_condition">
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK22F51212.internal_condition">
      <accept Dname="MK22FN512CAP12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VDC12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VFX12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VLH12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VLL12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VMP12" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.device=MK22F51212.internal_condition">
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.audio_sai_edma_adapter.condition_id">
      <require condition="allOf.driver.common, driver.sai_edma, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.sai_edma, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.component.gpio_adapter.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.component.gpio_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="anyOf.allOf=driver.codec, component.wm8904_adapter, allOf=driver.codec, component.wm8960_adapter, allOf=driver.codec, component.sgtl_adapter, allOf=driver.codec, component.da7212_adapter, allOf=driver.codec, component.cs42888_adapter.internal_condition"/>
      <require condition="allOf.device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.codec, component.wm8904_adapter, allOf=driver.codec, component.wm8960_adapter, allOf=driver.codec, component.sgtl_adapter, allOf=driver.codec, component.da7212_adapter, allOf=driver.codec, component.cs42888_adapter.internal_condition">
      <accept condition="allOf.driver.codec, component.wm8904_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.wm8960_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.sgtl_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.da7212_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.cs42888_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.driver.codec, component.wm8904_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.wm8960_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.sgtl_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.da7212_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.cs42888_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.driver.common, anyOf=component.i2c_adapter, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, anyOf=component.i2c_adapter, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="anyOf.component.i2c_adapter.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.component.i2c_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter"/>
    </condition>
    <condition id="component.crc_adapter.condition_id">
      <require condition="allOf.driver.common, driver.crc, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.crc, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
