RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.driver.cs42888, driver.codec, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.cs42888, driver.codec, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.driver.dialog7212, driver.codec, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dialog7212, driver.codec, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.dspi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.dspi, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dspi, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.driver.common, component.flash_adapter, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.flash_adapter, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash_adapter"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flash, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flash, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.ftm_adapter.condition_id">
      <require condition="allOf.driver.common, driver.ftm, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.ftm, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ftm"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.driver.gpio, anyOf=driver.port, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.gpio, anyOf=driver.port, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="anyOf.driver.port.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.port.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
    </condition>
    <condition id="component.i2c_adapter.condition_id">
      <require condition="allOf.driver.common, driver.i2c, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.i2c, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole_lite.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console_lite, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console_lite, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.driver.common, component.log, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.lptmr_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lptmr, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lptmr, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
