RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <condition id="component.lptmr_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lptmr, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.lpuart_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpuart, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpuart, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.lpuart_dma_adapter.condition_id">
      <require condition="allOf.component.lpuart_adapter, component.timer_manager, anyOf=driver.lpuart_edma, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, component.timer_manager, anyOf=driver.lpuart_edma, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.driver.lpuart_edma.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart_edma.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.driver.common, component.lists, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.pit_adapter.condition_id">
      <require condition="allOf.driver.common, driver.pit, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.pit, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.pit_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.common, driver.pit, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.pwm_ftm_adapter.condition_id">
      <require condition="allOf.driver.common, driver.ftm, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.driver.common, driver.rnga, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.rnga, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rnga"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.rtc.condition_id">
      <require condition="allOf.driver.common, driver.rtc, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.rtc, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtc"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.component.serial_manager, anyOf=allOf=driver.dspi, component.dspi_adapter, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, anyOf=allOf=driver.dspi, component.dspi_adapter, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.allOf=driver.dspi, component.dspi_adapter.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
