RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <condition id="anyOf.allOf=driver.dspi, component.dspi_adapter.internal_condition">
      <accept condition="allOf.driver.dspi, component.dspi_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dspi, component.dspi_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_adapter"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.core=cm4f, driver.common, component.serial_manager, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm4f, driver.common, component.serial_manager, device=MK22F51212.internal_condition">
      <require condition="core.cm4f.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="core.cm4f.internal_condition">
      <accept Dcore="Cortex-M4"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.uart_adapter, component.serial_manager, anyOf=driver.lpuart, driver.uart, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.component.uart_adapter, component.serial_manager, anyOf=driver.lpuart, driver.uart, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.driver.lpuart, driver.uart.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart, driver.uart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, driver.common, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.driver.sgtl5000, driver.codec, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sgtl5000, driver.codec, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.ftm_adapter, component.lptmr_adapter, component.pit_adapter, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.ftm_adapter, component.lptmr_adapter, component.pit_adapter, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.ftm_adapter, component.lptmr_adapter, component.pit_adapter.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.component.ftm_adapter, component.lptmr_adapter, component.pit_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="ftm_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="pit_adapter"/>
    </condition>
    <condition id="component.uart_adapter.condition_id">
      <require condition="allOf.driver.common, driver.uart, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.uart, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.driver.wm8904, driver.codec, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.wm8904, driver.codec, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.driver.wm8960, driver.codec, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.wm8960, driver.codec, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="device.MK22F51212_CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device_id=MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device_id=MK22FN512xxx12.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="device.MK22F51212_linker.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MK22FN512xxx12.internal_condition">
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="device_ids.MK22FN512xxx12.internal_condition">
      <accept Dname="MK22FN512CAP12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VDC12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VFX12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VLH12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VLL12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN512VMP12" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MK22FN512xxx12.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MK22FN512xxx12.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MK22FN512xxx12.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.MK22F51212_startup.condition_id">
      <require condition="allOf.device.MK22F51212_system, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.device.MK22F51212_system, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MK22F51212_system"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
