RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.MK22F51212_system.condition_id">
      <require condition="allOf.device.MK22F51212_CMSIS, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.device.MK22F51212_CMSIS, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MK22F51212_header"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.adc16.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition">
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.cmp.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_dspi.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.dspi_edma, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MK22FN512xxx12, driver.dspi_edma, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition">
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_i2c.condition_id">
      <require condition="allOf.driver.i2c_edma, device_id=MK22FN512xxx12, driver.i2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.i2c_edma, device_id=MK22FN512xxx12, driver.i2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.driver.lpuart_edma, device_id=MK22FN512xxx12, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart_edma, device_id=MK22FN512xxx12, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_uart.condition_id">
      <require condition="allOf.driver.uart_edma, device_id=MK22FN512xxx12, driver.uart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.uart_edma, device_id=MK22FN512xxx12, driver.uart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma"/>
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.driver.common, anyOf=component.wm8904_adapter, component.wm8960_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.codec_adapters, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, anyOf=component.wm8904_adapter, component.wm8960_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.codec_adapters, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="anyOf.component.wm8904_adapter, component.wm8960_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.codec_adapters.internal_condition"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wm8904_adapter, component.wm8960_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.codec_adapters.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.driver.clock, device.MK22F51212_CMSIS, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.clock, device.MK22F51212_CMSIS, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MK22F51212_header"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm4f.condition_id">
      <require condition="cores.cm4f.internal_condition"/>
    </condition>
