RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <condition id="cores.cm4f.internal_condition">
      <accept Dcore="Cortex-M4"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.codec_i2c, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.dac.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dbi.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dspi.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dspi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.dspi, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.dspi, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.edma.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common, driver.dmamux.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MK22FN512xxx12, driver.common, driver.dmamux.internal_condition">
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="driver.ewm.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.flexbus.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=MK22F51212.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.ftm.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.i2c.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.i2c_edma.condition_id">
      <require condition="allOf.driver.edma, driver.i2c, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.i2c, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.llwu.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpuart, device_id=MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpuart, device_id=MK22FN512xxx12.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.pdb.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
