RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.pit.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.pmc.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rcm.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rnga.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sai.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sai_edma.condition_id">
      <require condition="allOf.driver.edma, driver.sai, device_id=MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.sai, device_id=MK22FN512xxx12.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.sim.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.smc.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.ssd1963.condition_id">
      <require condition="allOf.driver.dbi, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.uart.condition_id">
      <require condition="allOf.driver.common, device_id=MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MK22FN512xxx12.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
    </condition>
    <condition id="driver.uart_edma.condition_id">
      <require condition="allOf.driver.edma, driver.uart, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.uart, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.vref.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.wdog.condition_id">
      <require condition="allOf.device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.wm8904.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="driver.wm8960.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm4f.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm4f.internal_condition"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.utility.debug_console, driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, driver.common, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.utility.debug_console_lite, driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console_lite, driver.common, device=MK22F51212.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MK22F51212.internal_condition"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=MK22F51212.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.component.uart_adapter, device_id=MK22FN512xxx12, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.component.uart_adapter, device_id=MK22FN512xxx12, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter"/>
      <require condition="device_id.MK22FN512xxx12.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
