RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.3" condition="driver.cmp.condition_id">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_cmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_cmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="dspi_cmsis" Cversion="2.3.0" Capiversion="2.2.0" condition="driver.cmsis_dspi.condition_id">
      <description>DSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/cmsis_drivers/fsl_dspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/cmsis_drivers/fsl_dspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="i2c_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_i2c.condition_id">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/cmsis_drivers/fsl_i2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/cmsis_drivers/fsl_i2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.5.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Cversion="2.1.0" Capiversion="2.3.0" condition="driver.cmsis_uart.condition_id">
      <description>UART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/cmsis_drivers/fsl_uart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/cmsis_drivers/fsl_uart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.3.1" condition="driver.codec.condition_id">
      <description>Driver codec</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c" projectpath="codec"/>
        <file category="include" name="components/codec/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.4.0" condition="driver.common.condition_id">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm4f.condition_id" category="sourceC" name="devices/MK22F51212/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm4f.condition_id" category="header" name="devices/MK22F51212/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888" Cversion="2.1.3" condition="driver.cs42888.condition_id">
      <description>Driver cs42888</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef CODEC_CS42888_ENABLE
#define CODEC_CS42888_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42888/fsl_cs42888.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42888/fsl_cs42888.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42888/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.0.2" condition="driver.dac.condition_id">
      <description>DAC Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_dac.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_dac.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi" Cversion="1.0.0" condition="driver.dbi.condition_id">
      <description>Driver dbi</description>
      <files>
        <file category="header" name="components/video/display/dbi/fsl_dbi.h" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.3.0" condition="driver.dialog7212.condition_id">
      <description>Driver dialog7212</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_DA7212_ENABLE
#define CODEC_DA7212_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c" projectpath="codec"/>
        <file category="include" name="components/codec/da7212/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.0" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dspi" Cversion="2.2.5" condition="driver.dspi.condition_id">
      <description>DSPI Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_dspi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_dspi.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
