RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_edma" Cversion="2.2.5" condition="driver.dspi_edma.condition_id">
      <description>DSPI Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_dspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_dspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.4.3" condition="driver.edma.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ewm" Cversion="2.0.3" condition="driver.ewm.condition_id">
      <description>EWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_ewm.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ewm.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash" Cversion="3.1.3" condition="driver.flash.condition_id">
      <description>Flash Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ftfx_adapter.h" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ftfx_utilities.h" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ftfx_features.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_ftfx_controller.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ftfx_controller.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_ftfx_flash.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ftfx_flash.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_ftfx_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ftfx_cache.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_ftfx_flexnvm.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ftfx_flexnvm.h" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_flash.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexbus" Cversion="2.1.1" condition="driver.flexbus.condition_id">
      <description>FLEXBUS Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_flexbus.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_flexbus.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="driver.ft5406.condition_id">
      <description>Driver ft5406</description>
      <files>
        <file category="header" name="components/ft5406/fsl_ft5406.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/ft5406/fsl_ft5406.c" projectpath="touchpanel"/>
        <file category="include" name="components/ft5406/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft6x06" Cversion="1.0.0" condition="driver.ft6x06.condition_id">
      <description>Driver ft6x06</description>
      <files>
        <file category="header" name="components/ft6x06/fsl_ft6x06.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/ft6x06/fsl_ft6x06.c" projectpath="touchpanel"/>
        <file category="include" name="components/ft6x06/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ftm" Cversion="2.6.1" condition="driver.ftm.condition_id">
      <description>FTM Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_ftm.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_ftm.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.7.3" condition="driver.gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.0.9" condition="driver.i2c.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_i2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_i2c.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.0.9" condition="driver.i2c_edma.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_i2c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_i2c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
