RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.2" condition="driver.ili9341.condition_id">
      <description>Driver ili9341</description>
      <files>
        <file category="header" name="components/ili9341/fsl_ili9341.h" projectpath="lcd"/>
        <file category="sourceC" name="components/ili9341/fsl_ili9341.c" projectpath="lcd"/>
        <file category="include" name="components/ili9341/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="llwu" Cversion="2.0.5" condition="driver.llwu.condition_id">
      <description>LLWU Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_llwu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_llwu.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr" Cversion="2.2.0" condition="driver.lptmr.condition_id">
      <description>LPTMR Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_lptmr.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_lptmr.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.7.6" condition="driver.lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.6.0" condition="driver.lpuart_edma.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_lpuart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_lpuart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="2.0.0" condition="driver.mx25r_flash.condition_id">
      <description>Driver mx25r_flash</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h" projectpath="source"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c" projectpath="source"/>
        <file category="include" name="components/mx25r_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pdb" Cversion="2.0.4" condition="driver.pdb.condition_id">
      <description>PDB Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_pdb.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_pdb.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="header" name="components/pf1550/fsl_pf1550.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf1550/fsl_pf1550.c" projectpath="pmic_driver"/>
        <file category="header" name="components/pf1550/fsl_pf1550_charger.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf1550/fsl_pf1550_charger.c" projectpath="pmic_driver"/>
        <file category="include" name="components/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="header" name="components/pf3000/fsl_pf3000.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf3000/fsl_pf3000.c" projectpath="pmic_driver"/>
        <file category="include" name="components/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pit" Cversion="2.0.4" condition="driver.pit.condition_id">
      <description>PIT Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_pit.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_pit.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pmc" Cversion="2.0.3" condition="driver.pmc.condition_id">
      <description>PMC Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_pmc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_pmc.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="port" Cversion="2.4.1" condition="driver.port.condition_id">
      <description>PORT Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_port.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rcm" Cversion="2.0.4" condition="driver.rcm.condition_id">
      <description>RCM Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_rcm.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_rcm.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
