RobertRostohar/NXP_Sensor_SDK/packs/MK22F51212_DFP/NXP.MK22F51212_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rnga" Cversion="2.0.2" condition="driver.rnga.condition_id">
      <description>RNGA Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_rnga.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_rnga.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtc" Cversion="2.3.0" condition="driver.rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="header" name="devices/MK22F51212/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.2" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.7.0" condition="driver.sai_edma.condition_id">
      <description>SAI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_sai_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_sai_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000" Cversion="2.1.1" condition="driver.sgtl5000.condition_id">
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/sgtl5000/fsl_sgtl5000.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/sgtl5000/fsl_sgtl5000.c" projectpath="codec"/>
        <file category="include" name="components/codec/sgtl5000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sim" Cversion="2.1.3" condition="driver.sim.condition_id">
      <description>SIM Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_sim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_sim.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smc" Cversion="2.0.7" condition="driver.smc.condition_id">
      <description>SMC Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_smc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_smc.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963" Cversion="1.1.2" condition="driver.ssd1963.condition_id">
      <description>Driver ssd1963</description>
      <files>
        <file category="header" name="components/ssd1963/fsl_ssd1963.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/ssd1963/fsl_ssd1963.c" projectpath="lcdc"/>
        <file category="include" name="components/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart" Cversion="2.5.1" condition="driver.uart.condition_id">
      <description>UART Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_uart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_uart.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma" Cversion="2.5.3" condition="driver.uart_edma.condition_id">
      <description>UART Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_uart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_uart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="vref" Cversion="2.1.2" condition="driver.vref.condition_id">
      <description>VREF Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_vref.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_vref.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wdog" Cversion="2.0.1" condition="driver.wdog.condition_id">
      <description>WDOG Driver</description>
      <files>
        <file category="header" name="devices/MK22F51212/drivers/fsl_wdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MK22F51212/drivers/fsl_wdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MK22F51212/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904" Cversion="2.5.1" condition="driver.wm8904.condition_id">
      <description>Driver wm8904</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_WM8904_ENABLE
#define CODEC_WM8904_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8904/fsl_wm8904.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8904/fsl_wm8904.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8904/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960" Cversion="2.2.4" condition="driver.wm8960.condition_id">
      <description>Driver wm8960</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_WM8960_ENABLE
#define CODEC_WM8960_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8960/fsl_wm8960.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8960/fsl_wm8960.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8960/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/readme.txt" projectpath="middleware/bm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.</description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MK22F51212/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MK22F51212/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f.condition_id" category="sourceAsm" name="devices/MK22F51212/utilities/fsl_memcpy.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/utilities/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/MK22F51212/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/MK22F51212/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MK22F51212/utilities/debug_console/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/debug_console/fsl_debug_console.h" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/debug_console/fsl_debug_console_conf.h" projectpath="utilities"/>
        <file category="include" name="devices/MK22F51212/utilities/str/"/>
        <file category="include" name="devices/MK22F51212/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MK22F51212/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities"/>
        <file category="include" name="devices/MK22F51212/utilities/str/"/>
        <file category="include" name="devices/MK22F51212/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/MK22F51212/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <RTE_Components_h>
#ifndef DEBUG_CONSOLE_RX_ENABLE
#define DEBUG_CONSOLE_RX_ENABLE 0
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="devices/MK22F51212/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="include" name="devices/MK22F51212/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="sourceC" name="devices/MK22F51212/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/MK22F51212/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="include" name="devices/MK22F51212/utilities/str/"/>
      </files>
    </component>
  </components>
</package>
